# d = {
#     'first': 1,
#     'second': 2,
# }
# print(d)

# ключем может быть любой неизменяемый тип данных
# строка - неизменяемый тип данных

# у словарей нет индексов

# d2 = {
#     1: [1, 2, 3],
#     342.54: 2,
#     True: False,
#     'four': 'rrr',
#     'five': 43.435,
#     'english words': {
#         'cat': 'кот',
#         'dog': 'собака',
#         'list': ['кот', 'собака']
#     }
# }

# print(d2)
# print(d2[1]) # False
# print(d2[True])
# print(d2['five'])
# print(d2['english words'])
# print(d2['english words']['dog'])
# print()
# print(d2['english words']['list'][0]) #обращение к элементу словаря (словарю№2) к списку внутри к первому элементу
# print(d2['english words']['list'][1]) #обращение к элементу словаря (словарю№2) к списку внутри к второму элементу

# изменение элементов списка

# изменение добавление
# print(d2)   #{1: False, 342.54: 2, 'four': 'rrr', 'five': 43.435, 'english words': {'cat': 'кот', 'dog': 'собака', 'list': ['кот', 'собака']}}
# d2[1] = 555 #{1: 555, 342.54: 2, 'four': 'rrr', 'five': 43.435, 'english words': {'cat': 'кот', 'dog': 'собака', 'list': ['кот', 'собака']}}
# print(d2)
# d2[1] += 555
# print(d2)   #{1: 1110, 342.54: 2, 'four': 'rrr', 'five': 43.435, 'english words': {'cat': 'кот', 'dog': 'собака', 'list': ['кот', 'собака']}}
# d2['four'] += 'd'
# print(d2)   #{1: 1110, 342.54: 2, 'four': 'rrrd', 'five': 43.435, 'english words': {'cat': 'кот', 'dog': 'собака', 'list': ['кот', 'собака']}}
# математические операции можно делать числа с числами/ строки со строками

# удаление
# print(d2)
# d2[1] = 555
# print(d2) #{1: 555, 342.54: 2, 'four': 'rrr', 'five': 43.435, 'english words': {'cat': 'кот', 'dog': 'собака', 'list': ['кот', 'собака']}}
# del d2[1] # удаление ключ-значения
# print(d2) #{342.54: 2, 'four': 'rrr', 'five': 43.435, 'english words': {'cat': 'кот', 'dog': 'собака', 'list': ['кот', 'собака']}}

# проверка наличия ключа в словаре, делать обязательно
# if 1 in d2:
#     del d2[1]
#     print('ключ удален')
# else:
#     print('ключа нет в словаре')
#
# # удаление всех элементов в словаре
# d2.clear()
# d2 = {}
# print(d2)


# объединение словарей
# d1 = {
#     'first': 1,
#     'second': 2,
# }
# d2 = {
#     1: [1, 2, 3],
#     342.54: 2,
#     True: False,
#     'four': 'rrr',
#     'five': 43.435,
# }
# print(d1)
# print(d2)
# d1.update(d2) #объеденить
# print(d1)
# print(d2)

# перебор словаря
# d = {
#     'a': 10,
#     'b': 2,
#     'c': 6,
# }
# print(d)
# основной закрывает все вопросы
# for key in d:
#     print(key, d[key])

# доп перебор по ключ-значение
# for key in d.keys():
#     print(key, d[key])

# перебор значений, доступа к ключу нету
# for val in d.values():
#     print(val)

# возвращение ключ-значение в виде кортежей
# for item in d.items():
#     print(item)
# ('a', 10)
# ('b', 2)
# ('c', 6)


# КОРТЕЖИ

# my_list = [1, 2, 3]
# my_list[0] = 999
# my_tuple = (1, 2, 3)
# # my_tuple = 1, 2, 3  # повтор верхней строки можно без скобок
# # my_tuple[0] = 999 # error ИЗМЕНИТЬ НЕ МОЖЕМ
# print(my_tuple[0]) # посмотреть можем

# рокировка значений
# a = 1
# b = 2
# a, b = b, a
# print(a, b) #2 1

# распаковка кортежей
# d = {
#     'a': 10,
#     'b': 2,
#     'c': 6,
# }
# for i in d.items():
#     print(i) # вывод кортежей
# for key, val in d.items():
#     print(key, val) # распаковка